XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sec_eng_reg.h
/* 0x5FC : se_gmac_0_ctrl_prot */
#define SEC_ENG_SE_GMAC_0_CTRL_PROT_OFFSET (0x5FC)
#define SEC_ENG_SE_GMAC_ID0_EN             SEC_ENG_SE_GMAC_ID0_EN
#define SEC_ENG_SE_GMAC_ID0_EN_POS         (1U)
#define SEC_ENG_SE_GMAC_ID0_EN_LEN         (1U)
#define SEC_ENG_SE_GMAC_ID0_EN_MSK         (((1U << SEC_ENG_SE_GMAC_ID0_EN_LEN) - 1) << SEC_ENG_SE_GMAC_ID0_EN_POS)
#define SEC_ENG_SE_GMAC_ID0_EN_UMSK        (~(((1U << SEC_ENG_SE_GMAC_ID0_EN_LEN) - 1) << SEC_ENG_SE_GMAC_ID0_EN_POS))
#define SEC_ENG_SE_GMAC_ID1_EN             SEC_ENG_SE_GMAC_ID1_EN
#define SEC_ENG_SE_GMAC_ID1_EN_POS         (2U)
#define SEC_ENG_SE_GMAC_ID1_EN_LEN         (1U)
#define SEC_ENG_SE_GMAC_ID1_EN_MSK         (((1U << SEC_ENG_SE_GMAC_ID1_EN_LEN) - 1) << SEC_ENG_SE_GMAC_ID1_EN_POS)
#define SEC_ENG_SE_GMAC_ID1_EN_UMSK        (~(((1U << SEC_ENG_SE_GMAC_ID1_EN_LEN) - 1) << SEC_ENG_SE_GMAC_ID1_EN_POS))

/* 0xF00 : se_ctrl_prot_rd */
#define SEC_ENG_SE_CTRL_PROT_RD_OFFSET (0xF00)
#define SEC_ENG_SE_SHA_ID0_EN_RD       SEC_ENG_SE_SHA_ID0_EN_RD
#define SEC_ENG_SE_SHA_ID0_EN_RD_POS   (0U)
#define SEC_ENG_SE_SHA_ID0_EN_RD_LEN   (1U)
#define SEC_ENG_SE_SHA_ID0_EN_RD_MSK   (((1U << SEC_ENG_SE_SHA_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_SHA_ID0_EN_RD_POS)
#define SEC_ENG_SE_SHA_ID0_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_SHA_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_SHA_ID0_EN_RD_POS))
#define SEC_ENG_SE_SHA_ID1_EN_RD       SEC_ENG_SE_SHA_ID1_EN_RD
#define SEC_ENG_SE_SHA_ID1_EN_RD_POS   (1U)
#define SEC_ENG_SE_SHA_ID1_EN_RD_LEN   (1U)
#define SEC_ENG_SE_SHA_ID1_EN_RD_MSK   (((1U << SEC_ENG_SE_SHA_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_SHA_ID1_EN_RD_POS)
#define SEC_ENG_SE_SHA_ID1_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_SHA_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_SHA_ID1_EN_RD_POS))
#define SEC_ENG_SE_AES_ID0_EN_RD       SEC_ENG_SE_AES_ID0_EN_RD
#define SEC_ENG_SE_AES_ID0_EN_RD_POS   (2U)
#define SEC_ENG_SE_AES_ID0_EN_RD_LEN   (1U)
#define SEC_ENG_SE_AES_ID0_EN_RD_MSK   (((1U << SEC_ENG_SE_AES_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_RD_POS)
#define SEC_ENG_SE_AES_ID0_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_AES_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_RD_POS))
#define SEC_ENG_SE_AES_ID1_EN_RD       SEC_ENG_SE_AES_ID1_EN_RD
#define SEC_ENG_SE_AES_ID1_EN_RD_POS   (3U)
#define SEC_ENG_SE_AES_ID1_EN_RD_LEN   (1U)
#define SEC_ENG_SE_AES_ID1_EN_RD_MSK   (((1U << SEC_ENG_SE_AES_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_RD_POS)
#define SEC_ENG_SE_AES_ID1_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_AES_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_RD_POS))
#define SEC_ENG_SE_TRNG_ID0_EN_RD      SEC_ENG_SE_TRNG_ID0_EN_RD
#define SEC_ENG_SE_TRNG_ID0_EN_RD_POS  (4U)
#define SEC_ENG_SE_TRNG_ID0_EN_RD_LEN  (1U)
#define SEC_ENG_SE_TRNG_ID0_EN_RD_MSK  (((1U << SEC_ENG_SE_TRNG_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_RD_POS)
#define SEC_ENG_SE_TRNG_ID0_EN_RD_UMSK (~(((1U << SEC_ENG_SE_TRNG_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_RD_POS))
#define SEC_ENG_SE_TRNG_ID1_EN_RD      SEC_ENG_SE_TRNG_ID1_EN_RD
#define SEC_ENG_SE_TRNG_ID1_EN_RD_POS  (5U)
#define SEC_ENG_SE_TRNG_ID1_EN_RD_LEN  (1U)
#define SEC_ENG_SE_TRNG_ID1_EN_RD_MSK  (((1U << SEC_ENG_SE_TRNG_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_RD_POS)
#define SEC_ENG_SE_TRNG_ID1_EN_RD_UMSK (~(((1U << SEC_ENG_SE_TRNG_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_RD_POS))
#define SEC_ENG_SE_PKA_ID0_EN_RD       SEC_ENG_SE_PKA_ID0_EN_RD
#define SEC_ENG_SE_PKA_ID0_EN_RD_POS   (6U)
#define SEC_ENG_SE_PKA_ID0_EN_RD_LEN   (1U)
#define SEC_ENG_SE_PKA_ID0_EN_RD_MSK   (((1U << SEC_ENG_SE_PKA_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_PKA_ID0_EN_RD_POS)
#define SEC_ENG_SE_PKA_ID0_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_PKA_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_PKA_ID0_EN_RD_POS))
#define SEC_ENG_SE_PKA_ID1_EN_RD       SEC_ENG_SE_PKA_ID1_EN_RD
#define SEC_ENG_SE_PKA_ID1_EN_RD_POS   (7U)
#define SEC_ENG_SE_PKA_ID1_EN_RD_LEN   (1U)
#define SEC_ENG_SE_PKA_ID1_EN_RD_MSK   (((1U << SEC_ENG_SE_PKA_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_PKA_ID1_EN_RD_POS)
#define SEC_ENG_SE_PKA_ID1_EN_RD_UMSK  (~(((1U << SEC_ENG_SE_PKA_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_PKA_ID1_EN_RD_POS))
#define SEC_ENG_SE_CDET_ID0_EN_RD      SEC_ENG_SE_CDET_ID0_EN_RD
#define SEC_ENG_SE_CDET_ID0_EN_RD_POS  (8U)
#define SEC_ENG_SE_CDET_ID0_EN_RD_LEN  (1U)
#define SEC_ENG_SE_CDET_ID0_EN_RD_MSK  (((1U << SEC_ENG_SE_CDET_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_CDET_ID0_EN_RD_POS)
#define SEC_ENG_SE_CDET_ID0_EN_RD_UMSK (~(((1U << SEC_ENG_SE_CDET_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_CDET_ID0_EN_RD_POS))
#define SEC_ENG_SE_CDET_ID1_EN_RD      SEC_ENG_SE_CDET_ID1_EN_RD
#define SEC_ENG_SE_CDET_ID1_EN_RD_POS  (9U)
#define SEC_ENG_SE_CDET_ID1_EN_RD_LEN  (1U)
#define SEC_ENG_SE_CDET_ID1_EN_RD_MSK  (((1U << SEC_ENG_SE_CDET_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_CDET_ID1_EN_RD_POS)
#define SEC_ENG_SE_CDET_ID1_EN_RD_UMSK (~(((1U << SEC_ENG_SE_CDET_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_CDET_ID1_EN_RD_POS))
#define SEC_ENG_SE_GMAC_ID0_EN_RD      SEC_ENG_SE_GMAC_ID0_EN_RD
#define SEC_ENG_SE_GMAC_ID0_EN_RD_POS  (10U)
#define SEC_ENG_SE_GMAC_ID0_EN_RD_LEN  (1U)
#define SEC_ENG_SE_GMAC_ID0_EN_RD_MSK  (((1U << SEC_ENG_SE_GMAC_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_GMAC_ID0_EN_RD_POS)
#define SEC_ENG_SE_GMAC_ID0_EN_RD_UMSK (~(((1U << SEC_ENG_SE_GMAC_ID0_EN_RD_LEN) - 1) << SEC_ENG_SE_GMAC_ID0_EN_RD_POS))
#define SEC_ENG_SE_GMAC_ID1_EN_RD      SEC_ENG_SE_GMAC_ID1_EN_RD
#define SEC_ENG_SE_GMAC_ID1_EN_RD_POS  (11U)
#define SEC_ENG_SE_GMAC_ID1_EN_RD_LEN  (1U)
#define SEC_ENG_SE_GMAC_ID1_EN_RD_MSK  (((1U << SEC_ENG_SE_GMAC_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_GMAC_ID1_EN_RD_POS)
#define SEC_ENG_SE_GMAC_ID1_EN_RD_UMSK (~(((1U << SEC_ENG_SE_GMAC_ID1_EN_RD_LEN) - 1) << SEC_ENG_SE_GMAC_ID1_EN_RD_POS))
#define SEC_ENG_SE_DBG_DIS             SEC_ENG_SE_DBG_DIS
#define SEC_ENG_SE_DBG_DIS_POS         (31U)
#define SEC_ENG_SE_DBG_DIS_LEN         (1U)
#define SEC_ENG_SE_DBG_DIS_MSK         (((1U << SEC_ENG_SE_DBG_DIS_LEN) - 1) << SEC_ENG_SE_DBG_DIS_POS)
#define SEC_ENG_SE_DBG_DIS_UMSK        (~(((1U << SEC_ENG_SE_DBG_DIS_LEN) - 1) << SEC_ENG_SE_DBG_DIS_POS))

/* 0xF04 : se_ctrl_reserved_0 */
#define SEC_ENG_SE_CTRL_RESERVED_0_OFFSET (0xF04)
#define SEC_ENG_SE_CTRL_RESERVED_0        SEC_ENG_SE_CTRL_RESERVED_0
#define SEC_ENG_SE_CTRL_RESERVED_0_POS    (0U)
#define SEC_ENG_SE_CTRL_RESERVED_0_LEN    (32U)
#define SEC_ENG_SE_CTRL_RESERVED_0_MSK    (((1U << SEC_ENG_SE_CTRL_RESERVED_0_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_0_POS)
#define SEC_ENG_SE_CTRL_RESERVED_0_UMSK   (~(((1U << SEC_ENG_SE_CTRL_RESERVED_0_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_0_POS))

/* 0xF08 : se_ctrl_reserved_1 */
#define SEC_ENG_SE_CTRL_RESERVED_1_OFFSET (0xF08)
#define SEC_ENG_SE_CTRL_RESERVED_1        SEC_ENG_SE_CTRL_RESERVED_1
#define SEC_ENG_SE_CTRL_RESERVED_1_POS    (0U)
#define SEC_ENG_SE_CTRL_RESERVED_1_LEN    (32U)
#define SEC_ENG_SE_CTRL_RESERVED_1_MSK    (((1U << SEC_ENG_SE_CTRL_RESERVED_1_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_1_POS)
#define SEC_ENG_SE_CTRL_RESERVED_1_UMSK   (~(((1U << SEC_ENG_SE_CTRL_RESERVED_1_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_1_POS))

/* 0xF0C : se_ctrl_reserved_2 */
#define SEC_ENG_SE_CTRL_RESERVED_2_OFFSET (0xF0C)
#define SEC_ENG_SE_CTRL_RESERVED_2        SEC_ENG_SE_CTRL_RESERVED_2
#define SEC_ENG_SE_CTRL_RESERVED_2_POS    (0U)
#define SEC_ENG_SE_CTRL_RESERVED_2_LEN    (32U)
#define SEC_ENG_SE_CTRL_RESERVED_2_MSK    (((1U << SEC_ENG_SE_CTRL_RESERVED_2_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_2_POS)
#define SEC_ENG_SE_CTRL_RESERVED_2_UMSK   (~(((1U << SEC_ENG_SE_CTRL_RESERVED_2_LEN) - 1) << SEC_ENG_SE_CTRL_RESERVED_2_POS))

struct sec_eng_reg {
    /* 0x0 : se_sha_0_ctrl */
    union {
        struct {
            uint32_t se_sha_0_busy       : 1;  /* [    0],          r,        0x0 */
            uint32_t se_sha_0_trig_1t    : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_sha_0_mode       : 3;  /* [ 4: 2],        r/w,        0x0 */
            uint32_t se_sha_0_en         : 1;  /* [    5],        r/w,        0x0 */
            uint32_t se_sha_0_hash_sel   : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7          : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t se_sha_0_int        : 1;  /* [    8],          r,        0x0 */
            uint32_t se_sha_0_int_clr_1t : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_sha_0_int_set_1t : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_sha_0_int_mask   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_sha_0_mode_ext   : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14         : 1;  /* [   14],       rsvd,        0x0 */
            uint32_t se_sha_0_link_mode  : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_sha_0_msg_len    : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_ctrl;

