XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sec_eng_reg.h
    /* 0x104 : se_aes_0_msa */
    union {
        struct {
            uint32_t se_aes_0_msa : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_msa;

    /* 0x108 : se_aes_0_mda */
    union {
        struct {
            uint32_t se_aes_0_mda : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_mda;

    /* 0x10C : se_aes_0_status */
    union {
        struct {
            uint32_t se_aes_0_status : 32; /* [31: 0],          r,     0x4100 */
        } BF;
        uint32_t WORD;
    } se_aes_0_status;

    /* 0x110 : se_aes_0_iv_0 */
    union {
        struct {
            uint32_t se_aes_0_iv_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_iv_0;

    /* 0x114 : se_aes_0_iv_1 */
    union {
        struct {
            uint32_t se_aes_0_iv_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_iv_1;

    /* 0x118 : se_aes_0_iv_2 */
    union {
        struct {
            uint32_t se_aes_0_iv_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_iv_2;

    /* 0x11C : se_aes_0_iv_3 */
    union {
        struct {
            uint32_t se_aes_0_iv_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_iv_3;

    /* 0x120 : se_aes_0_key_0 */
    union {
        struct {
            uint32_t se_aes_0_key_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_0;

    /* 0x124 : se_aes_0_key_1 */
    union {
        struct {
            uint32_t se_aes_0_key_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_1;

    /* 0x128 : se_aes_0_key_2 */
    union {
        struct {
            uint32_t se_aes_0_key_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_2;

    /* 0x12C : se_aes_0_key_3 */
    union {
        struct {
            uint32_t se_aes_0_key_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_3;

    /* 0x130 : se_aes_0_key_4 */
    union {
        struct {
            uint32_t se_aes_0_key_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_4;

    /* 0x134 : se_aes_0_key_5 */
    union {
        struct {
            uint32_t se_aes_0_key_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_5;

    /* 0x138 : se_aes_0_key_6 */
    union {
        struct {
            uint32_t se_aes_0_key_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_6;

    /* 0x13C : se_aes_0_key_7 */
    union {
        struct {
            uint32_t se_aes_0_key_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_7;

    /* 0x140 : se_aes_0_key_sel */
    union {
        struct {
            uint32_t se_aes_0_key_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_key_sel;

    /* 0x144 : se_aes_1_key_sel */
    union {
        struct {
            uint32_t se_aes_1_key_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_1_key_sel;

    /* 0x148 : se_aes_0_endian */
    union {
        struct {
            uint32_t se_aes_0_dout_endian : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_aes_0_din_endian  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_aes_0_key_endian  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t se_aes_0_iv_endian   : 1;  /* [    3],        r/w,        0x1 */
            uint32_t se_aes_0_twk_endian  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_29        : 25; /* [29: 5],       rsvd,        0x0 */
            uint32_t se_aes_0_ctr_len     : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_endian;

    /* 0x14C : se_aes_sboot */
    union {
        struct {
            uint32_t se_aes_sboot_key_sel : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_14        : 14; /* [14: 1],       rsvd,        0x0 */
            uint32_t se_aes_0_xts_mode    : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_aes_0_uni_len     : 16; /* [31:16],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } se_aes_sboot;

    /* 0x150 : se_aes_0_link */
    union {
        struct {
            uint32_t se_aes_0_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_link;

    /* 0x154  reserved */
    uint8_t RESERVED0x154[168];

    /* 0x1FC : se_aes_0_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_aes_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_aes_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_ctrl_prot;

    /* 0x200 : se_trng_0_ctrl_0 */
    union {
        struct {
            uint32_t se_trng_0_busy           : 1;  /* [    0],          r,        0x0 */
            uint32_t se_trng_0_trig_1t        : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_trng_0_en             : 1;  /* [    2],        r/w,        0x0 */
            uint32_t se_trng_0_dout_clr_1t    : 1;  /* [    3],        w1p,        0x0 */
            uint32_t se_trng_0_ht_error       : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_7             : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t se_trng_0_int            : 1;  /* [    8],          r,        0x0 */
            uint32_t se_trng_0_int_clr_1t     : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_trng_0_int_set_1t     : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_trng_0_int_mask       : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12              : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t se_trng_0_manual_fun_sel : 1;  /* [   13],        r/w,        0x0 */
            uint32_t se_trng_0_manual_reseed  : 1;  /* [   14],        r/w,        0x0 */
            uint32_t se_trng_0_manual_en      : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_31           : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_ctrl_0;

