XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sec_eng_reg.h
/* 0x48 : se_aes_endian */
#define SEC_ENG_SE_AES_ENDIAN_OFFSET    (0x48)
#define SEC_ENG_SE_AES_DOUT_ENDIAN      SEC_ENG_SE_AES_DOUT_ENDIAN
#define SEC_ENG_SE_AES_DOUT_ENDIAN_POS  (0U)
#define SEC_ENG_SE_AES_DOUT_ENDIAN_LEN  (1U)
#define SEC_ENG_SE_AES_DOUT_ENDIAN_MSK  (((1U << SEC_ENG_SE_AES_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_DOUT_ENDIAN_POS)
#define SEC_ENG_SE_AES_DOUT_ENDIAN_UMSK (~(((1U << SEC_ENG_SE_AES_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_DOUT_ENDIAN_POS))
#define SEC_ENG_SE_AES_DIN_ENDIAN       SEC_ENG_SE_AES_DIN_ENDIAN
#define SEC_ENG_SE_AES_DIN_ENDIAN_POS   (1U)
#define SEC_ENG_SE_AES_DIN_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_DIN_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_DIN_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_DIN_ENDIAN_POS)
#define SEC_ENG_SE_AES_DIN_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_DIN_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_DIN_ENDIAN_POS))
#define SEC_ENG_SE_AES_KEY_ENDIAN       SEC_ENG_SE_AES_KEY_ENDIAN
#define SEC_ENG_SE_AES_KEY_ENDIAN_POS   (2U)
#define SEC_ENG_SE_AES_KEY_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_KEY_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_KEY_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_KEY_ENDIAN_POS)
#define SEC_ENG_SE_AES_KEY_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_KEY_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_KEY_ENDIAN_POS))
#define SEC_ENG_SE_AES_IV_ENDIAN        SEC_ENG_SE_AES_IV_ENDIAN
#define SEC_ENG_SE_AES_IV_ENDIAN_POS    (3U)
#define SEC_ENG_SE_AES_IV_ENDIAN_LEN    (1U)
#define SEC_ENG_SE_AES_IV_ENDIAN_MSK    (((1U << SEC_ENG_SE_AES_IV_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_IV_ENDIAN_POS)
#define SEC_ENG_SE_AES_IV_ENDIAN_UMSK   (~(((1U << SEC_ENG_SE_AES_IV_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_IV_ENDIAN_POS))
#define SEC_ENG_SE_AES_TWK_ENDIAN       SEC_ENG_SE_AES_TWK_ENDIAN
#define SEC_ENG_SE_AES_TWK_ENDIAN_POS   (4U)
#define SEC_ENG_SE_AES_TWK_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_TWK_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_TWK_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_TWK_ENDIAN_POS)
#define SEC_ENG_SE_AES_TWK_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_TWK_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_TWK_ENDIAN_POS))
#define SEC_ENG_SE_AES_CTR_LEN          SEC_ENG_SE_AES_CTR_LEN
#define SEC_ENG_SE_AES_CTR_LEN_POS      (30U)
#define SEC_ENG_SE_AES_CTR_LEN_LEN      (2U)
#define SEC_ENG_SE_AES_CTR_LEN_MSK      (((1U << SEC_ENG_SE_AES_CTR_LEN_LEN) - 1) << SEC_ENG_SE_AES_CTR_LEN_POS)
#define SEC_ENG_SE_AES_CTR_LEN_UMSK     (~(((1U << SEC_ENG_SE_AES_CTR_LEN_LEN) - 1) << SEC_ENG_SE_AES_CTR_LEN_POS))

/* 0x4c : se_aes_sboot */
#define SEC_ENG_SE_AES_SBOOT_OFFSET       (0x4c)
#define SEC_ENG_SE_AES_SBOOT_KEY_SEL      SEC_ENG_SE_AES_SBOOT_KEY_SEL
#define SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS  (0U)
#define SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN  (1U)
#define SEC_ENG_SE_AES_SBOOT_KEY_SEL_MSK  (((1U << SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS)
#define SEC_ENG_SE_AES_SBOOT_KEY_SEL_UMSK (~(((1U << SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS))
#define SEC_ENG_SE_AES_XTS_MODE           SEC_ENG_SE_AES_XTS_MODE
#define SEC_ENG_SE_AES_XTS_MODE_POS       (15U)
#define SEC_ENG_SE_AES_XTS_MODE_LEN       (1U)
#define SEC_ENG_SE_AES_XTS_MODE_MSK       (((1U << SEC_ENG_SE_AES_XTS_MODE_LEN) - 1) << SEC_ENG_SE_AES_XTS_MODE_POS)
#define SEC_ENG_SE_AES_XTS_MODE_UMSK      (~(((1U << SEC_ENG_SE_AES_XTS_MODE_LEN) - 1) << SEC_ENG_SE_AES_XTS_MODE_POS))
#define SEC_ENG_SE_AES_UNI_LEN            SEC_ENG_SE_AES_UNI_LEN
#define SEC_ENG_SE_AES_UNI_LEN_POS        (16U)
#define SEC_ENG_SE_AES_UNI_LEN_LEN        (16U)
#define SEC_ENG_SE_AES_UNI_LEN_MSK        (((1U << SEC_ENG_SE_AES_UNI_LEN_LEN) - 1) << SEC_ENG_SE_AES_UNI_LEN_POS)
#define SEC_ENG_SE_AES_UNI_LEN_UMSK       (~(((1U << SEC_ENG_SE_AES_UNI_LEN_LEN) - 1) << SEC_ENG_SE_AES_UNI_LEN_POS))

/* 0x50 : se_aes_link */
#define SEC_ENG_SE_AES_LINK_OFFSET (0x50)
#define SEC_ENG_SE_AES_LCA         SEC_ENG_SE_AES_LCA
#define SEC_ENG_SE_AES_LCA_POS     (0U)
#define SEC_ENG_SE_AES_LCA_LEN     (32U)
#define SEC_ENG_SE_AES_LCA_MSK     (((1U << SEC_ENG_SE_AES_LCA_LEN) - 1) << SEC_ENG_SE_AES_LCA_POS)
#define SEC_ENG_SE_AES_LCA_UMSK    (~(((1U << SEC_ENG_SE_AES_LCA_LEN) - 1) << SEC_ENG_SE_AES_LCA_POS))

/* 0xfc : se_aes_ctrl_prot */
#define SEC_ENG_SE_AES_CTRL_PROT_OFFSET (0xfc)
#define SEC_ENG_SE_AES_PROT_EN          SEC_ENG_SE_AES_PROT_EN
#define SEC_ENG_SE_AES_PROT_EN_POS      (0U)
#define SEC_ENG_SE_AES_PROT_EN_LEN      (1U)
#define SEC_ENG_SE_AES_PROT_EN_MSK      (((1U << SEC_ENG_SE_AES_PROT_EN_LEN) - 1) << SEC_ENG_SE_AES_PROT_EN_POS)
#define SEC_ENG_SE_AES_PROT_EN_UMSK     (~(((1U << SEC_ENG_SE_AES_PROT_EN_LEN) - 1) << SEC_ENG_SE_AES_PROT_EN_POS))
#define SEC_ENG_SE_AES_ID0_EN           SEC_ENG_SE_AES_ID0_EN
#define SEC_ENG_SE_AES_ID0_EN_POS       (1U)
#define SEC_ENG_SE_AES_ID0_EN_LEN       (1U)
#define SEC_ENG_SE_AES_ID0_EN_MSK       (((1U << SEC_ENG_SE_AES_ID0_EN_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_POS)
#define SEC_ENG_SE_AES_ID0_EN_UMSK      (~(((1U << SEC_ENG_SE_AES_ID0_EN_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_POS))
#define SEC_ENG_SE_AES_ID1_EN           SEC_ENG_SE_AES_ID1_EN
#define SEC_ENG_SE_AES_ID1_EN_POS       (2U)
#define SEC_ENG_SE_AES_ID1_EN_LEN       (1U)
#define SEC_ENG_SE_AES_ID1_EN_MSK       (((1U << SEC_ENG_SE_AES_ID1_EN_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_POS)
#define SEC_ENG_SE_AES_ID1_EN_UMSK      (~(((1U << SEC_ENG_SE_AES_ID1_EN_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_POS))

struct sec_eng_aes_reg {
    /* 0x0 : se_aes_ctrl */
    union {
        struct
        {
            uint32_t se_aes_busy        : 1;  /* [    0],          r,        0x0 */
            uint32_t se_aes_trig_1t     : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_aes_en          : 1;  /* [    2],        r/w,        0x0 */
            uint32_t se_aes_mode        : 2;  /* [ 4: 3],        r/w,        0x0 */
            uint32_t se_aes_dec_en      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t se_aes_dec_key_sel : 1;  /* [    6],        r/w,        0x0 */
            uint32_t se_aes_hw_key_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t se_aes_int         : 1;  /* [    8],          r,        0x0 */
            uint32_t se_aes_int_clr_1t  : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_aes_int_set_1t  : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_aes_int_mask    : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_aes_block_mode  : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t se_aes_iv_sel      : 1;  /* [   14],        r/w,        0x0 */
            uint32_t se_aes_link_mode   : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_aes_msg_len     : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_ctrl;

    /* 0x4 : se_aes_msa */
    union {
        struct
        {
            uint32_t se_aes_msa : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_msa;

