XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sec_eng_reg.h
    /* 0x8 : se_aes_mda */
    union {
        struct
        {
            uint32_t se_aes_mda : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_mda;

    /* 0xc : se_aes_status */
    union {
        struct
        {
            uint32_t se_aes_status : 32; /* [31: 0],          r,     0x4100 */
        } BF;
        uint32_t WORD;
    } se_aes_status;

    /* 0x10 : se_aes_iv_0 */
    union {
        struct
        {
            uint32_t se_aes_iv_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_iv_0;

    /* 0x14 : se_aes_iv_1 */
    union {
        struct
        {
            uint32_t se_aes_iv_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_iv_1;

    /* 0x18 : se_aes_iv_2 */
    union {
        struct
        {
            uint32_t se_aes_iv_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_iv_2;

    /* 0x1c : se_aes_iv_3 */
    union {
        struct
        {
            uint32_t se_aes_iv_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_iv_3;

    /* 0x20 : se_aes_key_0 */
    union {
        struct
        {
            uint32_t se_aes_key_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_0;

    /* 0x24 : se_aes_key_1 */
    union {
        struct
        {
            uint32_t se_aes_key_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_1;

    /* 0x28 : se_aes_key_2 */
    union {
        struct
        {
            uint32_t se_aes_key_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_2;

    /* 0x2c : se_aes_key_3 */
    union {
        struct
        {
            uint32_t se_aes_key_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_3;

    /* 0x30 : se_aes_key_4 */
    union {
        struct
        {
            uint32_t se_aes_key_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_4;

    /* 0x34 : se_aes_key_5 */
    union {
        struct
        {
            uint32_t se_aes_key_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_5;

    /* 0x38 : se_aes_key_6 */
    union {
        struct
        {
            uint32_t se_aes_key_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_6;

    /* 0x3c : se_aes_key_7 */
    union {
        struct
        {
            uint32_t se_aes_key_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_7;

    /* 0x40 : se_aes_key_sel_0 */
    union {
        struct
        {
            uint32_t se_aes_key_sel_0 : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_sel_0;

    /* 0x44 : se_aes_key_sel_1 */
    union {
        struct
        {
            uint32_t se_aes_key_sel_1 : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_key_sel_1;

    /* 0x48 : se_aes_endian */
    union {
        struct
        {
            uint32_t se_aes_dout_endian : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_aes_din_endian  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_aes_key_endian  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t se_aes_iv_endian   : 1;  /* [    3],        r/w,        0x1 */
            uint32_t se_aes_twk_endian  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_29      : 25; /* [29: 5],       rsvd,        0x0 */
            uint32_t se_aes_ctr_len     : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_endian;

    /* 0x4c : se_aes_sboot */
    union {
        struct
        {
            uint32_t se_aes_sboot_key_sel : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_14        : 14; /* [14: 1],       rsvd,        0x0 */
            uint32_t se_aes_xts_mode      : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_aes_uni_len       : 16; /* [31:16],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } se_aes_sboot;

    /* 0x50 : se_aes_link */
    union {
        struct
        {
            uint32_t se_aes_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_link;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[168];

    /* 0xfc : se_aes_ctrl_prot */
    union {
        struct
        {
            uint32_t se_aes_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_aes_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_aes_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31  : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_ctrl_prot;
};

typedef volatile struct sec_eng_aes_reg sec_eng_aes_reg_t;

#define SEC_ENG_AES_OFFSET 0x100

/*Following is reg patch*/

/* 0x0 : se_trng_ctrl_0 */
#define SEC_ENG_SE_TRNG_CTRL_0_OFFSET       (0x0)
#define SEC_ENG_SE_TRNG_BUSY                SEC_ENG_SE_TRNG_BUSY
#define SEC_ENG_SE_TRNG_BUSY_POS            (0U)
#define SEC_ENG_SE_TRNG_BUSY_LEN            (1U)
#define SEC_ENG_SE_TRNG_BUSY_MSK            (((1U << SEC_ENG_SE_TRNG_BUSY_LEN) - 1) << SEC_ENG_SE_TRNG_BUSY_POS)
#define SEC_ENG_SE_TRNG_BUSY_UMSK           (~(((1U << SEC_ENG_SE_TRNG_BUSY_LEN) - 1) << SEC_ENG_SE_TRNG_BUSY_POS))
#define SEC_ENG_SE_TRNG_TRIG_1T             SEC_ENG_SE_TRNG_TRIG_1T
#define SEC_ENG_SE_TRNG_TRIG_1T_POS         (1U)
#define SEC_ENG_SE_TRNG_TRIG_1T_LEN         (1U)
#define SEC_ENG_SE_TRNG_TRIG_1T_MSK         (((1U << SEC_ENG_SE_TRNG_TRIG_1T_LEN) - 1) << SEC_ENG_SE_TRNG_TRIG_1T_POS)
#define SEC_ENG_SE_TRNG_TRIG_1T_UMSK        (~(((1U << SEC_ENG_SE_TRNG_TRIG_1T_LEN) - 1) << SEC_ENG_SE_TRNG_TRIG_1T_POS))
#define SEC_ENG_SE_TRNG_EN                  SEC_ENG_SE_TRNG_EN
#define SEC_ENG_SE_TRNG_EN_POS              (2U)
#define SEC_ENG_SE_TRNG_EN_LEN              (1U)
#define SEC_ENG_SE_TRNG_EN_MSK              (((1U << SEC_ENG_SE_TRNG_EN_LEN) - 1) << SEC_ENG_SE_TRNG_EN_POS)
#define SEC_ENG_SE_TRNG_EN_UMSK             (~(((1U << SEC_ENG_SE_TRNG_EN_LEN) - 1) << SEC_ENG_SE_TRNG_EN_POS))
#define SEC_ENG_SE_TRNG_DOUT_CLR_1T         SEC_ENG_SE_TRNG_DOUT_CLR_1T
#define SEC_ENG_SE_TRNG_DOUT_CLR_1T_POS     (3U)
#define SEC_ENG_SE_TRNG_DOUT_CLR_1T_LEN     (1U)
#define SEC_ENG_SE_TRNG_DOUT_CLR_1T_MSK     (((1U << SEC_ENG_SE_TRNG_DOUT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_CLR_1T_POS)
#define SEC_ENG_SE_TRNG_DOUT_CLR_1T_UMSK    (~(((1U << SEC_ENG_SE_TRNG_DOUT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_CLR_1T_POS))
#define SEC_ENG_SE_TRNG_HT_ERROR            SEC_ENG_SE_TRNG_HT_ERROR
#define SEC_ENG_SE_TRNG_HT_ERROR_POS        (4U)
#define SEC_ENG_SE_TRNG_HT_ERROR_LEN        (1U)
#define SEC_ENG_SE_TRNG_HT_ERROR_MSK        (((1U << SEC_ENG_SE_TRNG_HT_ERROR_LEN) - 1) << SEC_ENG_SE_TRNG_HT_ERROR_POS)
#define SEC_ENG_SE_TRNG_HT_ERROR_UMSK       (~(((1U << SEC_ENG_SE_TRNG_HT_ERROR_LEN) - 1) << SEC_ENG_SE_TRNG_HT_ERROR_POS))
#define SEC_ENG_SE_TRNG_INT                 SEC_ENG_SE_TRNG_INT
#define SEC_ENG_SE_TRNG_INT_POS             (8U)
#define SEC_ENG_SE_TRNG_INT_LEN             (1U)
#define SEC_ENG_SE_TRNG_INT_MSK             (((1U << SEC_ENG_SE_TRNG_INT_LEN) - 1) << SEC_ENG_SE_TRNG_INT_POS)
#define SEC_ENG_SE_TRNG_INT_UMSK            (~(((1U << SEC_ENG_SE_TRNG_INT_LEN) - 1) << SEC_ENG_SE_TRNG_INT_POS))
#define SEC_ENG_SE_TRNG_INT_CLR_1T          SEC_ENG_SE_TRNG_INT_CLR_1T
#define SEC_ENG_SE_TRNG_INT_CLR_1T_POS      (9U)
#define SEC_ENG_SE_TRNG_INT_CLR_1T_LEN      (1U)
#define SEC_ENG_SE_TRNG_INT_CLR_1T_MSK      (((1U << SEC_ENG_SE_TRNG_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_INT_CLR_1T_POS)
#define SEC_ENG_SE_TRNG_INT_CLR_1T_UMSK     (~(((1U << SEC_ENG_SE_TRNG_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_INT_CLR_1T_POS))
#define SEC_ENG_SE_TRNG_INT_SET_1T          SEC_ENG_SE_TRNG_INT_SET_1T
#define SEC_ENG_SE_TRNG_INT_SET_1T_POS      (10U)
#define SEC_ENG_SE_TRNG_INT_SET_1T_LEN      (1U)
#define SEC_ENG_SE_TRNG_INT_SET_1T_MSK      (((1U << SEC_ENG_SE_TRNG_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_TRNG_INT_SET_1T_POS)
#define SEC_ENG_SE_TRNG_INT_SET_1T_UMSK     (~(((1U << SEC_ENG_SE_TRNG_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_TRNG_INT_SET_1T_POS))
#define SEC_ENG_SE_TRNG_INT_MASK            SEC_ENG_SE_TRNG_INT_MASK
#define SEC_ENG_SE_TRNG_INT_MASK_POS        (11U)
#define SEC_ENG_SE_TRNG_INT_MASK_LEN        (1U)
#define SEC_ENG_SE_TRNG_INT_MASK_MSK        (((1U << SEC_ENG_SE_TRNG_INT_MASK_LEN) - 1) << SEC_ENG_SE_TRNG_INT_MASK_POS)
#define SEC_ENG_SE_TRNG_INT_MASK_UMSK       (~(((1U << SEC_ENG_SE_TRNG_INT_MASK_LEN) - 1) << SEC_ENG_SE_TRNG_INT_MASK_POS))
#define SEC_ENG_SE_TRNG_MANUAL_FUN_SEL      SEC_ENG_SE_TRNG_MANUAL_FUN_SEL
#define SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_POS  (13U)
#define SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_LEN  (1U)
#define SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_MSK  (((1U << SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_POS)
#define SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_UMSK (~(((1U << SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_FUN_SEL_POS))
#define SEC_ENG_SE_TRNG_MANUAL_RESEED       SEC_ENG_SE_TRNG_MANUAL_RESEED
#define SEC_ENG_SE_TRNG_MANUAL_RESEED_POS   (14U)
#define SEC_ENG_SE_TRNG_MANUAL_RESEED_LEN   (1U)
#define SEC_ENG_SE_TRNG_MANUAL_RESEED_MSK   (((1U << SEC_ENG_SE_TRNG_MANUAL_RESEED_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_RESEED_POS)
#define SEC_ENG_SE_TRNG_MANUAL_RESEED_UMSK  (~(((1U << SEC_ENG_SE_TRNG_MANUAL_RESEED_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_RESEED_POS))
#define SEC_ENG_SE_TRNG_MANUAL_EN           SEC_ENG_SE_TRNG_MANUAL_EN
#define SEC_ENG_SE_TRNG_MANUAL_EN_POS       (15U)
#define SEC_ENG_SE_TRNG_MANUAL_EN_LEN       (1U)
#define SEC_ENG_SE_TRNG_MANUAL_EN_MSK       (((1U << SEC_ENG_SE_TRNG_MANUAL_EN_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_EN_POS)
#define SEC_ENG_SE_TRNG_MANUAL_EN_UMSK      (~(((1U << SEC_ENG_SE_TRNG_MANUAL_EN_LEN) - 1) << SEC_ENG_SE_TRNG_MANUAL_EN_POS))

/* 0x4 : se_trng_status */
#define SEC_ENG_SE_TRNG_STATUS_OFFSET (0x4)
#define SEC_ENG_SE_TRNG_STATUS        SEC_ENG_SE_TRNG_STATUS
#define SEC_ENG_SE_TRNG_STATUS_POS    (0U)
#define SEC_ENG_SE_TRNG_STATUS_LEN    (32U)
#define SEC_ENG_SE_TRNG_STATUS_MSK    (((1U << SEC_ENG_SE_TRNG_STATUS_LEN) - 1) << SEC_ENG_SE_TRNG_STATUS_POS)
#define SEC_ENG_SE_TRNG_STATUS_UMSK   (~(((1U << SEC_ENG_SE_TRNG_STATUS_LEN) - 1) << SEC_ENG_SE_TRNG_STATUS_POS))

/* 0x8 : se_trng_dout_0 */
#define SEC_ENG_SE_TRNG_DOUT_0_OFFSET (0x8)
#define SEC_ENG_SE_TRNG_DOUT_0        SEC_ENG_SE_TRNG_DOUT_0
#define SEC_ENG_SE_TRNG_DOUT_0_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_0_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_0_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_0_POS)
#define SEC_ENG_SE_TRNG_DOUT_0_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_0_POS))

